TexasInstruments/mspm0-sdk/source/ti/smbus/smbus.h
//*****************************************************************************
//
//! \brief   Enable support for Host Notify Protocol
//
//! Controller will respond to Default host address and recognize a host notify
//!   protocol.
//
//! \param smbus            Pointer to SMBus structure
//! \param hostAlertBuffer  Pointer to buffer to store host Alert response
//
//! \return  None
//
//*****************************************************************************
extern void SMBus_controllerEnableHostNotify(SMBus *smbus, uint8_t *hostAlertBuffer);

//*****************************************************************************
//
//! \brief   Disable support for Host Notify Protocol
//
//! Controller will not respond to Default host address and won't recognize 
//! the host notify protocol.
//
//! \param smbus    Pointer to SMBus structure
//
//! \return  None
//
//*****************************************************************************
extern void SMBus_controllerDisableHostNotify(SMBus *smbus);

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************

#endif //__SMBUS_H__
